In [52]:
import pandas as pd
dataframe = pd.read_csv(r"C:\Users\Himanshi\Downloads\df2-csv.csv")
dataframe.head()

,ID,_STATE,FMONTH,SEQNO,GENHLTH,PHYSHLTH,MENTHLTH,POORHLTH,MEDCOST1,CHECKUP1,...,_AGE_G,HTM4,WTKG3,_BMI5,_BMI5CAT,_CHLDCNT,_EDUCAG,_INCOMG1,_SMOKER3,DROCDY4_
0,0,25,1,b'2022000229',3,88,88,NaN,2,1,...,6,163.0,83,3124.0,4.0,1,4,7,4,5.400000e-79
1,1,25,1,b'2022000230',2,88,88,NaN,2,1,...,6,168.0,91,3228.0,4.0,1,4,6,4,3.000000e+00
2,2,25,1,b'2022000231',4,30,30,77.0,2,1,...,6,163.0,82,3090.0,4.0,1,2,9,1,5.400000e-79
3,3,25,1,b'2022000232',3,88,88,NaN,2,1,...,6,160.0,0,NaN,NaN,1,4,2,4,1.300000e+01
4,4,25,1,b'2022000233',2,88,88,NaN,2,1,...,3,173.0,54,1825.0,1.0,2,4,5,4,9.000000e+02

In [53]:
dataframe['CVDINFR4'].replace({7: 2, 9: 2}, inplace=True)
dataframe['ADDEPEV3'].replace({7: 2, 9: 2}, inplace=True)
dataframe['DIABETE4'].replace({7: 3, 9: 3}, inplace=True)
dataframe['MEDCOST1'].replace({7: 2, 9: 2}, inplace=True)
dataframe['DIFFWALK'].replace({7: 2, 9: 2}, inplace=True)

In [54]:
print("\nUnique values in CVDINFR4 after replacement:",dataframe['CVDINFR4'].unique())
print("\nUnique values in ADDEPEV3 after replacement:",dataframe['ADDEPEV3'].unique())
print("\nUnique values in DIABETE4 after replacement:",dataframe['DIABETE4'].unique())

Unique values in CVDINFR4 after replacement: [2 1]

Unique values in ADDEPEV3 after replacement: [2 1]

Unique values in DIABETE4 after replacement: [1 3 4 2]

In [55]:
columns_to_drop = [
    'PHYSHLTH', 'MENTHLTH', 'POORHLTH', 'HEIGHT3', 
    'USENOW3', 'ECIGNOW2', 'LCSFIRST', 'LCSLAST', 'LCSNUMCG',
    'DRNK3GE5', 'MAXDRNKS', 'LASTSMK2', 'STOPSMK2', 'DROCDY4_'
]

# Dropping the specified columns
dataframe.drop(columns=columns_to_drop, inplace=True)

In [56]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11029 entries, 0 to 11028
Data columns (total 38 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ID        11029 non-null  int64
 1   _STATE    11029 non-null  int64
 2   FMONTH    11029 non-null  int64
 3   SEQNO     11029 non-null  object
 4   GENHLTH   11029 non-null  int64
 5   MEDCOST1  11029 non-null  int64
 6   CHECKUP1  11029 non-null  int64
 7   SLEPTIM1  11029 non-null  int64
 8   CVDINFR4  11029 non-null  int64
 9   ADDEPEV3  11029 non-null  int64
 10  DIABETE4  11029 non-null  int64
 11  MARITAL   11029 non-null  int64
 12  RENTHOM1  11029 non-null  int64
 13  EMPLOY1   10974 non-null  float64
 14  PREGNANT  2303 non-null   float64
 15  DIFFWALK  10685 non-null  float64
 16  AVEDRNK3  6134 non-null   float64
 17  SDHSTRE1  9667 non-null   float64
 18  QSTLANG   11029 non-null  int64
 19  _METSTAT  11029 non-null  int64
 20  _RFHLTH   11029 non-null  int64
 21  _PHYS14D  11029 non-null  int64
 22  _MENT14D  11029 non-null  int64
 23  _HLTHPLN  11029 non-null  int64
 24  _TOTINDA  11029 non-null  int64
 25  _MICHD    10918 non-null  float64
 26  _ASTHMS1  11029 non-null  int64
 27  _RACEPR1  11029 non-null  int64
 28  _SEX      11029 non-null  int64
 29  _AGE_G    11029 non-null  int64
 30  HTM4      10333 non-null  float64
 31  WTKG3     11029 non-null  int64
 32  _BMI5     9701 non-null   float64
 33  _BMI5CAT  9701 non-null   float64
 34  _CHLDCNT  11029 non-null  int64
 35  _EDUCAG   11029 non-null  int64
 36  _INCOMG1  11029 non-null  int64
 37  _SMOKER3  11029 non-null  int64
dtypes: float64(9), int64(28), object(1)
memory usage: 3.2+ MB

In [57]:
dataframe['EMPLOY1'].fillna(9, inplace=True)
dataframe['PREGNANT'].fillna(0, inplace=True)
dataframe['SDHSTRE1'].fillna(7, inplace=True)
dataframe['_MICHD'].fillna(2, inplace=True)

In [58]:
#df.info on a single column
#dataframe['_MICHD'].info()

In [59]:
mode_value = dataframe['SLEPTIM1'].mode().iloc[0] 
dataframe['SLEPTIM1'] = dataframe['SLEPTIM1'].replace([77, 99], mode_value)
#print(mode_value)

In [60]:
average = dataframe["HTM4"].mean()
dataframe["HTM4"].fillna(average, inplace=True)

averagew = dataframe["WTKG3"].mean()
dataframe["WTKG3"].fillna(averagew, inplace=True)

dataframe['HTM4'].info()
dataframe['WTKG3'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 11029 entries, 0 to 11028
Series name: HTM4
Non-Null Count  Dtype
--------------  -----
11029 non-null  float64
dtypes: float64(1)
memory usage: 86.3 KB
<class 'pandas.core.series.Series'>
RangeIndex: 11029 entries, 0 to 11028
Series name: WTKG3
Non-Null Count  Dtype
--------------  -----
11029 non-null  int64
dtypes: int64(1)
memory usage: 86.3 KB

In [61]:
dataframe['HTM4'] =  dataframe['HTM4']/100
dataframe['HTM4'].head()

0    1.63
1    1.68
2    1.63
3    1.60
4    1.73
Name: HTM4, dtype: float64

In [63]:
dataframe.to_csv("ABCD.csv")

In [64]:
data = pd.read_csv("ABCD.csv")

In [65]:
data.head()

,Unnamed: 0,ID,_STATE,FMONTH,SEQNO,GENHLTH,MEDCOST1,CHECKUP1,SLEPTIM1,CVDINFR4,...,_SEX,_AGE_G,HTM4,WTKG3,_BMI5,_BMI5CAT,_CHLDCNT,_EDUCAG,_INCOMG1,_SMOKER3
0,0,0,25,1,b'2022000229',3,2,1,9,2,...,1,6,1.63,83,3124.0,4.0,1,4,7,4
1,1,1,25,1,b'2022000230',2,2,1,8,2,...,2,6,1.68,91,3228.0,4.0,1,4,6,4
2,2,2,25,1,b'2022000231',4,2,1,8,1,...,2,6,1.63,82,3090.0,4.0,1,2,9,1
3,3,3,25,1,b'2022000232',3,2,1,7,1,...,2,6,1.60,0,NaN,NaN,1,4,2,4
4,4,4,25,1,b'2022000233',2,2,1,6,2,...,2,3,1.73,54,1825.0,1.0,2,4,5,4

In [66]:
data['HTM4']

0        1.630000
1        1.680000
2        1.630000
3        1.600000
4        1.730000
           ...
11024    1.698003
11025    1.650000
11026    1.830000
11027    1.680000
11028    1.680000
Name: HTM4, Length: 11029, dtype: float64

In [68]:
data['_BMI5'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 11029 entries, 0 to 11028
Series name: _BMI5
Non-Null Count  Dtype
--------------  -----
9701 non-null   float64
dtypes: float64(1)
memory usage: 86.3 KB

In [69]:
unique_count = data['SLEPTIM1'].nunique()
print(f"Number of unique values in 'SLEPTIM1': {unique_count}")

Number of unique values in 'SLEPTIM1': 21

In [71]:
value_counts = data['SLEPTIM1'].value_counts().sort_index()
print("\nValue counts in 'SLEPTIM1' (ascending order):")
print(value_counts)

Value counts in 'SLEPTIM1' (ascending order):
1       32
2       40
3       74
4      296
5      712
6     2314
7     3712
8     3040
9      462
10     242
11      26
12      51
13       3
14       5
15       3
16       3
18       2
19       1
20       4
22       2
24       5
Name: SLEPTIM1, dtype: int64

In [ ]:
columns_to_analyze = ['SLEPTIM1', 'MARITAL', 'RENTHOM1','EMPLOY1','_RACEPR1']

# Loop through the columns and print value counts in ascending order
for column in columns_to_analyze:
    value_counts = data[column].value_counts().sort_index()
    print(f"\nValue counts in '{column}' (ascending order):")
    print(value_counts)

In [72]:
condition = (data['SLEPTIM1'].isin([1, 2]) | (data['SLEPTIM1'].between(13, 24)))

# Delete rows based on the condition
data = data[~condition]

# Display the DataFrame after deletion
print("\nDataFrame after deletion:")

DataFrame after deletion:

In [73]:
value_counts = data['SLEPTIM1'].value_counts().sort_index()
print("\nValue counts in 'SLEPTIM1' (ascending order):")
print(value_counts)

Value counts in 'SLEPTIM1' (ascending order):
3       74
4      296
5      712
6     2314
7     3712
8     3040
9      462
10     242
11      26
12      51
Name: SLEPTIM1, dtype: int64

In [74]:
dataframe.to_csv("ABCD.csv")